-- ---------------------------------------------------
-- Вставить пользователей
-- ---------------------------------------------------

INSERT INTO User (`last_name`, `first_name`,
	`patronymic`, `nickname`, `password`,
    `e_mail`, `phone`)
VALUES ('Фамилия1', 'Имя1', 'Отчество1', 'Дрыбла1', '123',
		'bla@yandex.ru', 123456789),
        ('Фамилия2', 'Имя2', '', 'Дрыбла2', '123',
		'bla2@yandex.ru', 12345678),
        ('Фамилия3', 'Имя3', 'Отчество3', 'Дрыбла3', '123',
		'bla3@yandex.ru', ''),
        ('Фамилия4', 'Имя4', '', 'Дрыбла4', '123',
		'bla4@yandex.ru', '');

-- ---------------------------------------------------
-- Вставить самих питомцев
-- ---------------------------------------------------

INSERT INTO Pet (`pet_name`, `pet_gender`,
	`breed_id`, `pet_date_of_birth`,
    `pet_weight`, `activeness_type` ,`photos`, 
    `documents`, `med_info`)
VALUES ('Имя_животного1', 1, 1, '1024-11-24',
		5, 0, 'MEDIUMBLOB', 'BLOB', 'MEDIUMBLOB'),
        ('Имя_животного2', 0, 2, NULL,
		5, 1, 'MEDIUMBLOB', 'BLOB', 'MEDIUMBLOB'),
        ('Имя_животного3', 1, 3, '1024-11-24',
		5, 2, '', 'BLOB', 'MEDIUMBLOB'),
		('Имя_животного4', 0, 10, '1024-11-24',
		5, 3, 'MEDIUMBLOB', '', 'MEDIUMBLOB'),
		('Имя_животного5', 1, 15, '1024-11-24',
		5, 3, 'MEDIUMBLOB', 'BLOB', ''),
        ('Имя_животного6', 0, 6, NULL,
		5, 3, '', '', '');
        
-- ---------------------------------------------------
-- Вставить связи между питомцами и хозяевами
-- ---------------------------------------------------

INSERT INTO Owner (`User_id`, `Pet_id`)
VALUES (1, 1),
		(2, 2),
		(2, 3),
        (3, 3),
        (3, 2);
        
-- ---------------------------------------------------
-- Вставить рацион
-- ---------------------------------------------------

INSERT INTO `Diet` (`name`, `pet_id`, `auto_calc_diet`, 
					`pet_weight`, `activeness_type`, 
                    `food_id`, `food_per_day`)
VALUES ("Нормальная", 1, True, 2, 0, 1, 0),
		("Жесткая", 2, True, 3, 1, 1, 0),
        ("Впечатляющая", 2, True, 3, 2, 1, 0),
        ("Эпическая", 3, True, 7, 2, 3, 0),
        ("Легендарная", 4, False, 789, 3, 2, 255);

-- ---------------------------------------------------
-- Вставить порцию
-- ---------------------------------------------------

INSERT INTO `Portion` (`time`, `portion_size`, `diet_id`)
VALUES ("12:02:57", 25, 1),
		("21:02:57", 55, 1),
        ("23:59:27", 5, 2),
        ("11:08:10", 75, 3),
        ("18:00:01", 175, 4),
        ("09:07:04", 255, 5);

-- ---------------------------------------------------
-- Вставить уведомление, что питомец покормлен
-- ---------------------------------------------------

INSERT INTO `Feeding` (`portion_id`, `is_fed`, `date`)
VALUES 	(1, False, "29.02.2016"),
		(2, True, "05.02.2018"),
		(3, False, "25.08.2017"),
        (4, True, "17.04.2018"),
        (5, False, "14.08.2017");








